5.Mesh_doc_ref_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// novos pontos no eixo X: -0.105, -0.05, 0.05, 0.105

vertices
(
    // z = -0.035
    (-0.110000 -0.035 -0.035) // 0
    (-0.0320000 -0.035 -0.035) // 1
    ( 0.0320000 -0.035 -0.035) // 2
    ( 0.110000 -0.035 -0.035) // 3

    (-0.110000  0.035 -0.035) // 4
    (-0.0320000  0.035 -0.035) // 5
    ( 0.0320000  0.035 -0.035) // 6
    ( 0.110000  0.035 -0.035) // 7

    // z = +0.035
    (-0.110000 -0.035  0.035) // 8
    (-0.0320000 -0.035  0.035) // 9
    ( 0.0320000 -0.035  0.035) //10
    ( 0.110000 -0.035  0.035) //11

    (-0.110000  0.035  0.035) //12
    (-0.0320000  0.035  0.035) //13
    ( 0.0320000  0.035  0.035) //14
    ( 0.110000  0.035  0.035) //15
);

blocks
(
    // 🔹 bloco esquerdo (15% → 60 células)
    hex (0 1 5 4 8 9 13 12) (100 120  120)
    simpleGrading (2 1 1)

    // 🔹 bloco central (70% → 280 células)
    hex (1 2 6 5 9 10 14 13) (350 120  120)
    simpleGrading (1 1 1)

    // 🔹 bloco direito (15% → 60 células)
    hex (2 3 7 6 10 11 15 14) (100 120  120)
    simpleGrading (0.5 1 1)
);

edges
(
);

boundary
(
    boxWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)

            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)

            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)

            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)

            (0 4 12 8)
            (3 7 15 11)
        );
    }
);

mergePatchPairs
(
);
