5.Mesh_doc_ref_case/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers true;

geometry
{
    tpms
    {
        type triSurfaceMesh;
        file "tpms.stl";
    }

    nozzle
    {
        type triSurfaceMesh;
        file "nozzle.stl";
    }

    inlet
    {
        type triSurfaceMesh;
        file "inlet.stl";
    }

    outlet
    {
        type triSurfaceMesh;
        file "outlet.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells 2500000;
    maxGlobalCells 8000000;
    minRefinementCells 0;
    
    nCellsBetweenLevels 5;

    features ();

    refinementSurfaces
    {
        tpms
        {
            level (3 4);
        }

        nozzle
        {
            level (3 4);
        }

        inlet
        {
            level (2 2);
        }

        outlet
        {
            level (2 2);
        }
    }

    resolveFeatureAngle 30;

    refinementRegions {}

    locationInMesh (0.032 0 0);

    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 5;
    tolerance 1.0;
    nSolveIter 50;
    nRelaxIter 7;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        tpms
        {
            nSurfaceLayers 5;
        }
        nozzle
        {
            nSurfaceLayers 10;
        }
    }

    expansionRatio 1.1;

    finalLayerThickness 0.0005;

    minThickness 0.00025;

    nGrow 0;

    featureAngle 30;

    nRelaxIter 5;

    nSmoothSurfaceNormals 5;
    nSmoothNormals 5;
    nSmoothThickness 15;

    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 30;
}

meshQualityControls
{
    maxNonOrtho 65;

    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    maxConcave 80;

    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;

    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;

    maxSkewness 4;   
    relaxed
    {
        maxSkewness 4.5;
    }
}

mergeTolerance 1e-6;
